Revit 2024 API
EnergyAnalysisSurface Class
 Analytical surface. The collection of analytic openings belonging to this analytical parent surface
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class EnergyAnalysisSurface : Element
Visual Basic
Public Class EnergyAnalysisSurface _
	Inherits Element
Visual C++
public ref class EnergyAnalysisSurface : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
See Also
EnergyAnalysisSurface Members
Autodesk.Revit.DB.Analysis Namespace